

export type IErrorMessages = Record<number, string>;

export const API_ERRORS: IErrorMessages = {
    0: 'Відсутнє підключення до мережі',
    1: 'Сталася невідома помилка. Спробуйте пізніше',

    // 400 Bad Request
    1003: 'Будь ласка, введіть запит (назву міста)',
    1005: 'Невірний запит',
    1006: 'Локацію за вашим запитом не знайдено',
    9000: 'Помилка формату даних',
    9001: 'Перевищено ліміт: не більше 50 локацій за раз',

    // 401 Unauthorized
    1002: 'API-ключ не надано. Перевірте налаштування.',
    2006: 'Наданий API-ключ недійсний. Оновіть ключ у системі',

    // 403 Forbidden
    2007: 'Вичерпано місячний ліміт запитів. Перейдіть на інший тариф',
    2008: 'Ваш API-ключ було деактивовано',
    2009: 'Ваш тарифний план не має доступу до цього ресурсу',

    // 500 Internal Server Error
    9999: 'Сталася внутрішня помилка сервера. Спробуйте пізніше',
};